/* modifier */
"-" = "-";

/* modifier */
"+" = "+";

/* modifier */
"~" = "~";

/* the first letter of \"day\" */
"d" = "d";

/* days */
"day" = "日";

/* days */
"days" = "日間";

/* the first letter of \"hour\" */
"h" = "h";

/* hours */
"hour" = "時";

/* hours */
"hours" = "時間";

/* modifier */
"last" = "先";

/* last month */
"last month" = "先月";

/* time */
"last week" = "先週";

/* last year */
"last year" = "昨年";

/* the first letter of \"month\" */
"m" = "m";

/* month */
"month" = "月";

/* months */
"months" = "ヶ月";

/* modifier, the most commonly used translation of \"next\", or some other shorthand way of saying things like \"next week\" */
"next" = "来";

/* next month */
"next month" = "来月";

/* time */
"next week" = "来週";

/* next year */
"next year" = "来年";

/* noon */
"noon" = "正午";

/* now */
"now" = "現在";

/* modifier, the most commonly used translation of \"this\", or some other shorthand way of saying things like \"this week\" */
"this" = "今";

/* this month */
"this month" = "今月";

/* time */
"this week" = "今週";

/* this year */
"this year" = "今年";

/* \"tod\" this should be an abbreviation for \"today\" that makes sense for the given language */
"tod" = "今";

/* today */
"today" = "今日";

/* Today */
"Today" = "今日";

/* \"tom\" this should be an abbreviation for \"tomorrow\" that makes sense for the given language */
"tom" = "明";

/* tomorrow */
"tomorrow" = "明日";

/* Tomorrow */
"Tomorrow" = "明日";

/* tonight */
"tonight" = "今夜";

/* weeks */
"w" = "w";

/* weeks */
"week" = "週";

/* weeks */
"weeks" = "週間";

/* the first letter of \"year\" */
"y" = "y";

/* years */
"year" = "年";

/* years */
"years" = "年間";

/* \"yes\" this should be an abbreviation for \"yesterday\" that makes sense for the given language */
"yes" = "昨";

/* yesterday */
"yesterday" = "昨日";

/* Yesterday */
"Yesterday" = "昨日";